<template>
  <div class="container">
    <div class="text-h4">นครปฐม</div>
    <div class="pa-4 mt-4">
      <p>
        นครปฐมจังหวัดที่น่าสนใจอีกหนึ่งจังหวัด ที่เที่ยวนครปฐมที่ลายล้อมไปด้วยธรรมชาติ และสถานที่ท่องเที่ยวนครปฐมที่น่าสนใจ 
        ที่สำคัญสามารถเที่ยวนครปฐมได้ครบทุกสไตล์ กับนครปฐมที่เที่ยว ทั้งไหว้พระทำบุญ ชื่นชมธรรมชาติ หรือนั่งรับลมชิลๆ นครปฐมที่เที่ยวตอบโจทย์โดนใจสุดๆ
      </p>
      <div>
        <div>
          <v-card
            v-for="(item, index) in items" :key="index"
            class="mx-auto mb-4"
            outlined
          >
            <v-list-item three-line>
              <v-list-item-content>
                <v-list-item-title class="text-h5 mt-4">
                  {{ item.name }}
                </v-list-item-title>
                <v-card-subtitle>
                  Google Map: <a :href="item.map" target="_bank">{{ item.map }}</a> <br/>
                  เปิด: {{ item.timeOpen ? item.timeOpen : '' }} - {{ item.timeClose ? item.timeClose : '' }} น. <br/>
                  โทร: {{ item.tel }} 
                </v-card-subtitle>
              </v-list-item-content>

              <div class="mt-2 mr-4" v-for="(img, index) in item.images" :key="index">
                <v-img 
                class="inline-block"
                :src="img" 
                height="200px"
                width="200px"
                style="object-fit: cover;"
                ></v-img>
              </div>
            </v-list-item>

            <v-card-actions>
              <v-spacer></v-spacer>
              <v-btn
                text
                @click="item.show = !item.show"
              >
                {{ item.show ? 'อ่านน้อยลง' : 'อ่านเพิ่มเติม' }}
                <v-icon>{{ item.show ? 'mdi-chevron-up' : 'mdi-chevron-down' }}</v-icon>
              </v-btn>
            </v-card-actions>

            <v-expand-transition>
              <div v-show="item.show">
                <v-divider></v-divider>

                <v-card-text>
                  {{ item.contant }}
                </v-card-text>
              </div>
            </v-expand-transition>
          </v-card>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'IndexPage',
  layout: 'home',
  data(){
    return{
      items: [
        {
          id: 1,
          name: 'พระปฐมเจดีย์',
          map: 'https://goo.gl/maps/vWzRFTtRhE4Znh49A',
          timeOpen: '05:00',
          timeClose: '19:00',
          tel: '',
          images: [
            require('@/assets/images/1.webp'),
            require('@/assets/images/2.webp'),
            require('@/assets/images/3.webp'),
          ],
          contant: 'องค์พระปฐมเจดีย์ เจดีย์สีทองอร่ามตั้งเด่นเป็นสง่า สัญลักษณ์คู่บ้านคู่ เมืองนครปฐม และสถานที่ทางศาสนาที่สำคัญใน จังหวัดนครปฐม ตั้งอยู่ภายในพื้นที่ของ วัดพระปฐมเจดีย์ราชวรมหาวิหาร เป็น สถานที่ท่องเที่ยวเชิงประวัติศาสตร์ ที่สำคัญอีกแห่งของประเทศไทย และสำหรับชาวพุทธศาสนิกชนการได้มากราบไหว้ เป็นพุทธสถานสำคัญของประเทศไทย ที่ยังไงก็ต้องแวะมาสักการะ เมื่อมานครปฐม พระปฐมเจดีย์ ที่เที่ยวใกล้กรุงเทพนี้ สร้างขึ้นตั้งแต่ สมัยทวารวดี เก่าแก่ที่สุดในเมืองไทย เป็นพระเจดีย์ทรงลังกาใน แบบสุโขทัย ที่งดงาม และประดิษฐานพระบรมสารีริกธาตุ ของพระพุทธเจ้านอกจากนี้ยังมี พระร่วงโรจนฤทธิ์ ที่เป็นพระพุทธรูปยืนปางประทานอภัย ประดิษฐานอยู่ภายในซุ้มวิหารหน้าองค์พระปฐมเจดีย์ สร้างมาตั้งแต่ในสมัยรัชกาลที่ 6 โดย พระเศียร พระหัตถ์ และพระบาท นั้นนำมาจากเมืองศรีสัชนาลัย จังหวัดสุโขทัย และที่ฐานพระพุทธรูปองค์นี้ ยังเป็นที่บรรจุพระบรมอัฐิ ของพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัวอีกด้วย เสริมสร้างความเป็นสิริมงคลเริ่มต้น เที่ยวนครปฐม ที่พระปฐมเจดีย์',
          show: false,
        },
        {
          id: 2,
          name: 'วัดไร่ขิง',
          map: 'https://goo.gl/maps/fwvUXVUU7RTEfd5J6',
          timeOpen: '',
          timeClose: '',
          tel: '034-388-888',
          images: [
            require('@/assets/images/4.webp'),
            require('@/assets/images/5.webp'),
            require('@/assets/images/6.webp'),
          ],
          contant: 'ภายในพระอุโบสถเป็นที่ประดิษฐาน หลวงพ่อวัดไร่ขิง พระพุทธรูปปางมารวิชัย สมัยเชียงแสนวัดไร่ขิง เป็นพระอารามหลวงที่ประดิษฐานพระพุทธรูปศักดิ์สิทธิ์ที่งดงาม ด้วยพุทธศิลป์เชียงแสน คือหลวงพ่อวัดไร่ขิง ซึ่งเป็นหนึ่งใน ตำนานพระศักดิ์สิทธิ์ลอยน้ำ 5 พระองค์ พระอุโบสถของวัดเป็นศิลปะสมัยรัตนโกสินทร์ตอนต้น และยังมีภาพจิตรกรรมฝาผนังที่งดงามอีกทั้งภายในวัดยังมี พิพิธภัณฑ์ของเก่า ที่รวบรวมของเก่าเช่น ถ้วยชาม หนังสือเก่า ซึ่งชาวบ้านนำมาถวายวัด มาจัดแสดงไว้ให้ได้ชมกัน  มีกิจกรรมให้ ร่วมทำบุญให้อาหารปลาในแม่น้ำด้วยนะ ปลาเยอะมากๆ เลย ใครได้มาเยือนอิ่มอกอิ่มบุญปลื้มใจแน่นอน',
          show: false,
        },
        {
          id: 3,
          name: 'ตลาดน้ำดอนหวาย',
          map: 'https://goo.gl/maps/3vEoaCoQ8aAsB6AB9',
          timeOpen: '08:00',
          timeClose: '17:00',
          tel: '089-675-8018',
          images: [
            require('@/assets/images/7.webp'),
            require('@/assets/images/8.webp'),
          ],
          contant: '“ตลาดน้ำดอนหวาย” เป็นตลาดเก่าแก่ อีกแห่งหนึ่งของจังหวัด นครปฐม และ เป็นตลาดน้ำชื่อดัง ที่คนส่วนใหญ่แวะเวียนกันมาอย่างไม่ขาดสาย ลักษณะทางเดินจะเป็นตรอกเล็กๆ เข้าไปมีอาหารเรียงรายให้ได้ช้อป ชิมกันตลอดสองข้างทาง ทั้งอาหารคาว หวาน และของฝาก ไม่เพียงเท่านี้ที่นี่ยังมีกิจกรรมให้ทำ โดยการล่องเรือชมทิวทัศน์ริมฝั่งแม่น้ำ ตลอดไปถึง สถานที่ท่องเที่ยวนครปฐมที่สำคัญริมต่างแห่งต่างๆ ซึ่งจะมีเรือให้บริการอย่าง เรือศรีสวัสดิ์ย้อนยุค ที่เอา เรือเอี้ยมจุ๊น มาดัดแปลงตั้งโต๊ะ เก้าอี้ให้นั่งกันอย่างสบายๆ โดยเรือจะมี 3 เส้นทางให้เลือกเที่ยวชม แตกต่างกันไปตามความชอบ แน่นอนว่ามาเที่ยวที่นี่แล้ว อิ่มครบแถมมีของติดไม้ติดมือกลับไปฝากคนที่รักแน่นอนจ้า',
          show: false,
        },
        {
          id: 4,
          name: 'วัดกลางบางพระ',
          map: 'https://goo.gl/maps/c2T6qKuXcqGZNRLr9',
          timeOpen: '',
          timeClose: '',
          tel: '034-239-225',
          images: [
            require('@/assets/images/9.webp'),
            require('@/assets/images/10.webp'),
          ],
          contant: 'วัดกลางบางพระ จะประดิษฐาน หลวงพ่อสมหวัง พระพุทธรูปปางมารวิชัย หรือสะดุ้งมารคนที่มากราบไหว้หลวงพ่อแล้วสมหวังนั้น ส่วนใหญ่จะขอพรในเรื่องของ ความรัก ขอให้ครอบครัวมีความมั่นคง ทำให้คนโสด หรือคนมีคู่จากทั่วทั้งประเทศมากันเยอะมาก ใครสายมูเตลู คือห้ามหลาด เพิ่มความเป็นสิริมงคลให้แก่ชีวิต ก็นับว่าเป็นเรื่องที่ดีแล้ว  ส่วนเรื่องของการขอพรนั้น นับว่าเป็นผลพลอยได้ก็แล้วกัน เฮงๆ ปังๆ สมหวังแน่นอน',
          show: false,
        },
        {
          id: 5,
          name: 'พุทธมณฑล',
          map: 'https://goo.gl/maps/oejXoyfzAznGUiZr5',
          timeOpen: '05:00',
          timeClose: '19:00',
          tel: '',
          images: [
            require('@/assets/images/11.webp'),
            require('@/assets/images/12.webp'),
            require('@/assets/images/13.webp'),
          ],
          contant: 'พระศรีศากยะทศพลญาณ พระพุทธรูปปางลีลา หล่อด้วยทองสัมฤทธิ์สูงถึง 15.75 เมตร เด่นเป็นสง่า มีความงดงาม และแตกต่างจากพระพุทธรูปทั่วไปบริเวณรอบ ๆ ที่นี่มีความร่มรื่นด้วยต้นไม้ใบหญ้า ที่จัดแต่งเป็นอย่างดี ทั้งไม้ดอกไม้ใบ บางจุดจัดเป็นสวนหย่อมตัดแต่งต้นไม้ให้เป็นรูปสัตว์ มีบ่อน้ำ และฝายกั้นน้ำรอบบริเวณให้ความสดชื่นเย็นสบาย ใครผ่านไปมาแถวศาลายา อยากหาสถานที่เพื่อรับอากาศบริสุทธิ์ ให้อาหารปลา ไหว้พระ นั่งเล่น หรือแม้แต่วิ่งออกกำลังกาย สุดชิลผ่อนคลาย มาที่นี่ได้เลย',
          show: false,
        },
      ],
    }
  }
}
</script>
